results/iterations/redis_2mb_latency_iter10.txt
====== SET ======
  1000000 requests completed in 11.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 650689)
75.000% <= 0.295 milliseconds (cumulative count 876056)
93.750% <= 0.303 milliseconds (cumulative count 961810)
96.875% <= 0.311 milliseconds (cumulative count 985263)
99.219% <= 0.327 milliseconds (cumulative count 994008)
99.609% <= 0.351 milliseconds (cumulative count 996140)
99.805% <= 0.399 milliseconds (cumulative count 998171)
99.902% <= 0.471 milliseconds (cumulative count 999119)
99.951% <= 0.487 milliseconds (cumulative count 999666)
99.976% <= 0.503 milliseconds (cumulative count 999833)
99.988% <= 0.511 milliseconds (cumulative count 999878)
99.994% <= 0.703 milliseconds (cumulative count 999940)
99.997% <= 0.919 milliseconds (cumulative count 999970)
99.998% <= 0.999 milliseconds (cumulative count 999985)
99.999% <= 1.055 milliseconds (cumulative count 999993)
100.000% <= 1.287 milliseconds (cumulative count 999997)
100.000% <= 1.351 milliseconds (cumulative count 999999)
100.000% <= 1.383 milliseconds (cumulative count 1000000)
100.000% <= 1.383 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 17)
96.181% <= 0.303 milliseconds (cumulative count 961810)
99.832% <= 0.407 milliseconds (cumulative count 998320)
99.983% <= 0.503 milliseconds (cumulative count 999833)
99.993% <= 0.607 milliseconds (cumulative count 999927)
99.994% <= 0.703 milliseconds (cumulative count 999940)
99.995% <= 0.807 milliseconds (cumulative count 999952)
99.997% <= 0.903 milliseconds (cumulative count 999968)
99.999% <= 1.007 milliseconds (cumulative count 999987)
99.999% <= 1.103 milliseconds (cumulative count 999993)
99.999% <= 1.207 milliseconds (cumulative count 999995)
100.000% <= 1.303 milliseconds (cumulative count 999997)
100.000% <= 1.407 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89798.85 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.285     0.104     0.287     0.303     0.319     1.383
====== GET ======
  1000000 requests completed in 11.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.095 milliseconds (cumulative count 2)
50.000% <= 0.287 milliseconds (cumulative count 628011)
75.000% <= 0.295 milliseconds (cumulative count 859197)
87.500% <= 0.303 milliseconds (cumulative count 960646)
96.875% <= 0.311 milliseconds (cumulative count 988744)
99.219% <= 0.319 milliseconds (cumulative count 995374)
99.609% <= 0.327 milliseconds (cumulative count 997188)
99.805% <= 0.343 milliseconds (cumulative count 998296)
99.902% <= 0.463 milliseconds (cumulative count 999113)
99.951% <= 0.479 milliseconds (cumulative count 999612)
99.976% <= 0.487 milliseconds (cumulative count 999811)
99.988% <= 0.495 milliseconds (cumulative count 999924)
99.994% <= 0.503 milliseconds (cumulative count 999961)
99.997% <= 0.551 milliseconds (cumulative count 999970)
99.998% <= 0.575 milliseconds (cumulative count 999992)
99.999% <= 0.583 milliseconds (cumulative count 1000000)
100.000% <= 0.583 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 4)
0.001% <= 0.207 milliseconds (cumulative count 14)
96.065% <= 0.303 milliseconds (cumulative count 960646)
99.881% <= 0.407 milliseconds (cumulative count 998811)
99.996% <= 0.503 milliseconds (cumulative count 999961)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89621.80 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.285     0.088     0.287     0.303     0.319     0.583