results/iterations/redis_2mb_latency_iter2.txt
====== SET ======
  1000000 requests completed in 11.19 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 623154)
75.000% <= 0.295 milliseconds (cumulative count 848897)
87.500% <= 0.303 milliseconds (cumulative count 946394)
96.875% <= 0.311 milliseconds (cumulative count 976178)
98.438% <= 0.319 milliseconds (cumulative count 985511)
99.219% <= 0.351 milliseconds (cumulative count 992899)
99.609% <= 0.455 milliseconds (cumulative count 996250)
99.805% <= 0.503 milliseconds (cumulative count 998158)
99.902% <= 0.551 milliseconds (cumulative count 999135)
99.951% <= 0.583 milliseconds (cumulative count 999552)
99.976% <= 0.607 milliseconds (cumulative count 999791)
99.988% <= 0.623 milliseconds (cumulative count 999885)
99.994% <= 0.815 milliseconds (cumulative count 999940)
99.997% <= 0.855 milliseconds (cumulative count 999970)
99.998% <= 1.047 milliseconds (cumulative count 999985)
99.999% <= 1.231 milliseconds (cumulative count 999993)
100.000% <= 1.319 milliseconds (cumulative count 999997)
100.000% <= 1.351 milliseconds (cumulative count 999999)
100.000% <= 1.375 milliseconds (cumulative count 1000000)
100.000% <= 1.375 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 0.207 milliseconds (cumulative count 30)
94.639% <= 0.303 milliseconds (cumulative count 946394)
99.531% <= 0.407 milliseconds (cumulative count 995315)
99.816% <= 0.503 milliseconds (cumulative count 998158)
99.979% <= 0.607 milliseconds (cumulative count 999791)
99.992% <= 0.703 milliseconds (cumulative count 999916)
99.994% <= 0.807 milliseconds (cumulative count 999938)
99.998% <= 0.903 milliseconds (cumulative count 999976)
99.998% <= 1.007 milliseconds (cumulative count 999983)
99.999% <= 1.103 milliseconds (cumulative count 999987)
99.999% <= 1.207 milliseconds (cumulative count 999992)
100.000% <= 1.303 milliseconds (cumulative count 999996)
100.000% <= 1.407 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89333.57 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.287     0.104     0.287     0.311     0.335     1.375
====== GET ======
  1000000 requests completed in 11.17 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 620311)
75.000% <= 0.295 milliseconds (cumulative count 842321)
87.500% <= 0.303 milliseconds (cumulative count 947883)
96.875% <= 0.311 milliseconds (cumulative count 981700)
98.438% <= 0.319 milliseconds (cumulative count 991126)
99.219% <= 0.327 milliseconds (cumulative count 994331)
99.609% <= 0.343 milliseconds (cumulative count 996729)
99.805% <= 0.375 milliseconds (cumulative count 998071)
99.902% <= 0.463 milliseconds (cumulative count 999147)
99.951% <= 0.479 milliseconds (cumulative count 999673)
99.976% <= 0.487 milliseconds (cumulative count 999817)
99.988% <= 0.495 milliseconds (cumulative count 999884)
99.994% <= 0.519 milliseconds (cumulative count 999942)
99.997% <= 0.551 milliseconds (cumulative count 999971)
99.998% <= 0.591 milliseconds (cumulative count 999985)
99.999% <= 0.599 milliseconds (cumulative count 999999)
100.000% <= 0.607 milliseconds (cumulative count 1000000)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 16)
94.788% <= 0.303 milliseconds (cumulative count 947883)
99.856% <= 0.407 milliseconds (cumulative count 998564)
99.990% <= 0.503 milliseconds (cumulative count 999903)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89493.47 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.112     0.287     0.311     0.319     0.607