results/iterations/redis_2mb_latency_iter3.txt
====== SET ======
  1000000 requests completed in 11.19 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 582793)
75.000% <= 0.295 milliseconds (cumulative count 826382)
87.500% <= 0.303 milliseconds (cumulative count 945967)
96.875% <= 0.311 milliseconds (cumulative count 983546)
98.438% <= 0.319 milliseconds (cumulative count 993163)
99.609% <= 0.335 milliseconds (cumulative count 996954)
99.805% <= 0.367 milliseconds (cumulative count 998182)
99.902% <= 0.471 milliseconds (cumulative count 999283)
99.951% <= 0.479 milliseconds (cumulative count 999566)
99.976% <= 0.487 milliseconds (cumulative count 999760)
99.988% <= 0.511 milliseconds (cumulative count 999905)
99.994% <= 0.639 milliseconds (cumulative count 999939)
99.997% <= 1.055 milliseconds (cumulative count 999970)
99.998% <= 1.295 milliseconds (cumulative count 999987)
99.999% <= 1.335 milliseconds (cumulative count 999993)
100.000% <= 1.367 milliseconds (cumulative count 999999)
100.000% <= 1.391 milliseconds (cumulative count 1000000)
100.000% <= 1.391 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.001% <= 0.207 milliseconds (cumulative count 13)
94.597% <= 0.303 milliseconds (cumulative count 945967)
99.857% <= 0.407 milliseconds (cumulative count 998572)
99.987% <= 0.503 milliseconds (cumulative count 999874)
99.993% <= 0.607 milliseconds (cumulative count 999935)
99.995% <= 0.703 milliseconds (cumulative count 999948)
99.995% <= 0.807 milliseconds (cumulative count 999950)
99.996% <= 0.903 milliseconds (cumulative count 999956)
99.996% <= 1.007 milliseconds (cumulative count 999965)
99.997% <= 1.103 milliseconds (cumulative count 999975)
99.998% <= 1.207 milliseconds (cumulative count 999978)
99.999% <= 1.303 milliseconds (cumulative count 999988)
100.000% <= 1.407 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89365.51 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.096     0.287     0.311     0.319     1.391
====== GET ======
  1000000 requests completed in 11.24 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 576630)
75.000% <= 0.295 milliseconds (cumulative count 822527)
87.500% <= 0.303 milliseconds (cumulative count 942227)
96.875% <= 0.311 milliseconds (cumulative count 979192)
98.438% <= 0.319 milliseconds (cumulative count 988116)
99.219% <= 0.343 milliseconds (cumulative count 992429)
99.609% <= 0.407 milliseconds (cumulative count 996465)
99.805% <= 0.463 milliseconds (cumulative count 998217)
99.902% <= 0.487 milliseconds (cumulative count 999176)
99.951% <= 0.503 milliseconds (cumulative count 999542)
99.976% <= 0.519 milliseconds (cumulative count 999770)
99.988% <= 0.575 milliseconds (cumulative count 999886)
99.994% <= 1.271 milliseconds (cumulative count 999939)
99.997% <= 9.375 milliseconds (cumulative count 999970)
99.998% <= 9.655 milliseconds (cumulative count 999985)
99.999% <= 9.807 milliseconds (cumulative count 999993)
100.000% <= 9.879 milliseconds (cumulative count 999997)
100.000% <= 9.927 milliseconds (cumulative count 999999)
100.000% <= 9.951 milliseconds (cumulative count 1000000)
100.000% <= 9.951 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.002% <= 0.207 milliseconds (cumulative count 18)
94.223% <= 0.303 milliseconds (cumulative count 942227)
99.647% <= 0.407 milliseconds (cumulative count 996465)
99.954% <= 0.503 milliseconds (cumulative count 999542)
99.990% <= 0.607 milliseconds (cumulative count 999898)
99.990% <= 0.703 milliseconds (cumulative count 999905)
99.991% <= 0.807 milliseconds (cumulative count 999912)
99.992% <= 0.903 milliseconds (cumulative count 999919)
99.992% <= 1.007 milliseconds (cumulative count 999925)
99.993% <= 1.103 milliseconds (cumulative count 999931)
99.994% <= 1.207 milliseconds (cumulative count 999936)
99.994% <= 1.303 milliseconds (cumulative count 999941)
99.995% <= 1.407 milliseconds (cumulative count 999945)
99.995% <= 1.503 milliseconds (cumulative count 999949)
99.995% <= 1.607 milliseconds (cumulative count 999950)
99.995% <= 9.103 milliseconds (cumulative count 999951)
100.000% <= 10.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88928.41 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.288     0.096     0.287     0.311     0.327     9.951